Task/src/Documents/ПеремещениеМеждуКассами/ПеремещениеМеждуКассами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеМеждуКассами</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>КассаИсточник</name>
    <type>
      <types>CatalogRef.Касса</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПриемник</name>
    <type>
      <types>CatalogRef.Касса</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Task/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Касса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Task/src/Documents/ПеремещениеМеждуКассами/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Касса = КассаИсточник;
	Движение.Сумма = Сумма;
	
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Касса = КассаПриемник;
	Движение.Сумма = Сумма;
КонецПроцедуры
